---
kind: property
id: P:Autodesk.Revit.DB.Visual.WallPaint.WallpaintColor
source: html/0915273f-5ff0-9c20-a4b6-24dab324e7cb.htm
---
# Autodesk.Revit.DB.Visual.WallPaint.WallpaintColor Property

The property labeled "Color" from the "WallPaint" schema.

## Syntax (C#)
```csharp
public static string WallpaintColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.